> ((( (If True Then True Else True) )) :: Bool)
(Proof weight: 11, proof depth: 5)

                                                                                                                                       ("True" : "bool")                        ("True" : "bool")
                                                                                   ------------------- (EvalParens)                    ----------------------- (EvalAscrBool)   ----------------- (CanonBool)
                                                                                   (( True )) --> True                                 (True :: Bool) --> True                  (~)((True))
-------------------------------------- (EvalIfTrue)                                --------------------------------------- (EvalCtx)   ---------------------------------------------------------------------- (BigStepBase)
(If True Then True Else True) --> True                                             ((( True )) :: Bool) --> (True :: Bool)             (True :: Bool) ~~> True
---------------------------------------------------------------------- (EvalCtx)   ---------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( (If True Then True Else True) )) :: Bool) --> ((( True )) :: Bool)             ((( True )) :: Bool) ~~> True
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( (If True Then True Else True) )) :: Bool) ~~> True



> 42
(Proof weight: 3, proof depth: 3)

(42 : "number")
--------------- (CanonNumber)
(~)((42))
----------------------------- (BigStepCanon)
42 ~~> 42



> True
(Proof weight: 3, proof depth: 3)

("True" : "bool")
----------------- (CanonBool)
(~)((True))
----------------------------- (BigStepCanon)
True ~~> True



> (( False ))
(Proof weight: 4, proof depth: 3)

                                     ("False" : "bool")
--------------------- (EvalParens)   ------------------ (CanonBool)
(( False )) --> False                (~)((False))
------------------------------------------------------------------- (BigStepBase)
(( False )) ~~> False



> (True :: Bool)
(Proof weight: 5, proof depth: 3)

("True" : "bool")                        ("True" : "bool")
----------------------- (EvalAscrBool)   ----------------- (CanonBool)
(True :: Bool) --> True                  (~)((True))
---------------------------------------------------------------------- (BigStepBase)
(True :: Bool) ~~> True



> (If True Then 42 Else 43)
(Proof weight: 4, proof depth: 3)

                                                (42 : "number")
-------------------------------- (EvalIfTrue)   --------------- (CanonNumber)
(If True Then 42 Else 43) --> 42                (~)((42))
----------------------------------------------------------------------------- (BigStepBase)
(If True Then 42 Else 43) ~~> 42



> (If False Then 23 Else 44)
(Proof weight: 4, proof depth: 3)

                                                  (44 : "number")
--------------------------------- (EvalIfFalse)   --------------- (CanonNumber)
(If False Then 23 Else 44) --> 44                 (~)((44))
------------------------------------------------------------------------------- (BigStepBase)
(If False Then 23 Else 44) ~~> 44



> (5 + 6)
(Proof weight: 6, proof depth: 3)

(5 : "number")   (6 : "number")              (11 : "number")
------------------------------- (EvalPlus)   --------------- (CanonNumber)
(5 + 6) --> 11                               (~)((11))
-------------------------------------------------------------------------- (BigStepBase)
(5 + 6) ~~> 11



> (5 + (6 + 7))
(Proof weight: 11, proof depth: 4)

(6 : "number")   (7 : "number")                        (5 : "number")   (13 : "number")              (18 : "number")
------------------------------- (EvalPlus)             -------------------------------- (EvalPlus)   --------------- (CanonNumber)
(6 + 7) --> 13                                         (5 + 13) --> 18                               (~)((18))
------------------------------------------ (EvalCtx)   --------------------------------------------------------------------------- (BigStepBase)
(5 + (6 + 7)) --> (5 + 13)                             (5 + 13) ~~> 18
------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
(5 + (6 + 7)) ~~> 18



> ((( \ x : Int . (x + 1) )) 5)
(Proof weight: 8, proof depth: 4)

                                                         (5 : "number")   (1 : "number")              (6 : "number")
                                                         ------------------------------- (EvalPlus)   -------------- (CanonNumber)
                                                         (5 + 1) --> 6                                (~)((6))
----------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------- (BigStepBase)
((( \ x : Int . (x + 1) )) 5) --> (5 + 1)                (5 + 1) ~~> 6
------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
((( \ x : Int . (x + 1) )) 5) ~~> 6



> ((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) )))
(Proof weight: 10, proof depth: 5)

                                                                                                                                                                       (5 : "number")   (1 : "number")              (6 : "number")
                                                                                                                                                                       ------------------------------- (EvalPlus)   -------------- (CanonNumber)
                                                                                                                                                                       (5 + 1) --> 6                                (~)((6))
                                                                                                              ----------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------- (BigStepBase)
                                                                                                              ((( \ i : Int . (i + 1) )) 5) --> (5 + 1)                (5 + 1) ~~> 6
---------------------------------------------------------------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) ))) --> ((( \ i : Int . (i + 1) )) 5)                ((( \ i : Int . (i + 1) )) 5) ~~> 6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) ))) ~~> 6



> (If (If True Then False Else True) Then 123456 Else 42)
(Proof weight: 7, proof depth: 4)

                                                                                                                                                             (42 : "number")
---------------------------------------- (EvalIfTrue)                                                  ------------------------------------- (EvalIfFalse)   --------------- (CanonNumber)
(If True Then False Else True) --> False                                                               (If False Then 123456 Else 42) --> 42                 (~)((42))
------------------------------------------------------------------------------------------ (EvalCtx)   ----------------------------------------------------------------------------------- (BigStepBase)
(If (If True Then False Else True) Then 123456 Else 42) --> (If False Then 123456 Else 42)             (If False Then 123456 Else 42) ~~> 42
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
(If (If True Then False Else True) Then 123456 Else 42) ~~> 42



> (5 + (6 + 7))
(Proof weight: 11, proof depth: 4)

(6 : "number")   (7 : "number")                        (5 : "number")   (13 : "number")              (18 : "number")
------------------------------- (EvalPlus)             -------------------------------- (EvalPlus)   --------------- (CanonNumber)
(6 + 7) --> 13                                         (5 + 13) --> 18                               (~)((18))
------------------------------------------ (EvalCtx)   --------------------------------------------------------------------------- (BigStepBase)
(5 + (6 + 7)) --> (5 + 13)                             (5 + 13) ~~> 18
------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
(5 + (6 + 7)) ~~> 18



> (5 + (( (6 + 7) )))
(Proof weight: 14, proof depth: 5)

                                                                                                (5 : "number")   (13 : "number")              (18 : "number")
                                                       --------------- (EvalParens)             -------------------------------- (EvalPlus)   --------------- (CanonNumber)
(6 : "number")   (7 : "number")                        (( 13 )) --> 13                          (5 + 13) --> 18                               (~)((18))
------------------------------- (EvalPlus)             ---------------------------- (EvalCtx)   --------------------------------------------------------------------------- (BigStepBase)
(6 + 7) --> 13                                         (5 + (( 13 ))) --> (5 + 13)              (5 + 13) ~~> 18
------------------------------------------ (EvalCtx)   ---------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
(5 + (( (6 + 7) ))) --> (5 + (( 13 )))                 (5 + (( 13 ))) ~~> 18
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
(5 + (( (6 + 7) ))) ~~> 18



> ((( (5 + 6) )) + (( (7 + 8) )))
(Proof weight: 22, proof depth: 7)

                                                                                                                                                                                                                                            (11 : "number")   (15 : "number")              (26 : "number")
                                                                                                                                                                                                  --------------- (EvalParens)              --------------------------------- (EvalPlus)   --------------- (CanonNumber)
                                                                                                                                           (7 : "number")   (8 : "number")                        (( 15 )) --> 15                           (11 + 15) --> 26                               (~)((26))
                                                                                                                                           ------------------------------- (EvalPlus)             ----------------------------- (EvalCtx)   ---------------------------------------------------------------------------- (BigStepBase)
                                                                                                                                           (7 + 8) --> 15                                         (11 + (( 15 ))) --> (11 + 15)             (11 + 15) ~~> 26
                                                                           --------------- (EvalParens)                                    ------------------------------------------ (EvalCtx)   ------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
(5 : "number")   (6 : "number")                                            (( 11 )) --> 11                                                 (11 + (( (7 + 8) ))) --> (11 + (( 15 )))               (11 + (( 15 ))) ~~> 26
------------------------------- (EvalPlus)                                 --------------------------------------------------- (EvalCtx)   -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
(5 + 6) --> 11                                                             ((( 11 )) + (( (7 + 8) ))) --> (11 + (( (7 + 8) )))             (11 + (( (7 + 8) ))) ~~> 26
-------------------------------------------------------------- (EvalCtx)   ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( (5 + 6) )) + (( (7 + 8) ))) --> ((( 11 )) + (( (7 + 8) )))             ((( 11 )) + (( (7 + 8) ))) ~~> 26
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( (5 + 6) )) + (( (7 + 8) ))) ~~> 26



