> 42
(Proof weight: 3, proof depth: 3)

(42 : "number")
--------------- (CanonNumber)
(~)((42))
----------------------------- (BigStepCanon)
42 ~~> 42



> True
(Proof weight: 3, proof depth: 3)

("True" : "bool")
----------------- (CanonBool)
(~)((True))
----------------------------- (BigStepCanon)
True ~~> True



> False
(Proof weight: 3, proof depth: 3)

("False" : "bool")
------------------ (CanonBool)
(~)((False))
------------------------------ (BigStepCanon)
False ~~> False



> (If True Then 42 Else 43)
(Proof weight: 4, proof depth: 3)

                                                (42 : "number")
-------------------------------- (EvalIfTrue)   --------------- (CanonNumber)
(If True Then 42 Else 43) --> 42                (~)((42))
----------------------------------------------------------------------------- (BigStepBase)
(If True Then 42 Else 43) ~~> 42



> (If False Then 23 Else 44)
(Proof weight: 4, proof depth: 3)

                                                  (44 : "number")
--------------------------------- (EvalIfFalse)   --------------- (CanonNumber)
(If False Then 23 Else 44) --> 44                 (~)((44))
------------------------------------------------------------------------------- (BigStepBase)
(If False Then 23 Else 44) ~~> 44



> (5 + 6)
(Proof weight: 6, proof depth: 3)

(5 : "number")   (6 : "number")              (11 : "number")
------------------------------- (EvalPlus)   --------------- (CanonNumber)
(5 + 6) --> 11                               (~)((11))
-------------------------------------------------------------------------- (BigStepBase)
(5 + 6) ~~> 11



> (5 + (6 + 7))
(Proof weight: 11, proof depth: 4)

(6 : "number")   (7 : "number")                          (5 : "number")   (13 : "number")              (18 : "number")
------------------------------- (EvalPlus)               -------------------------------- (EvalPlus)   --------------- (CanonNumber)
(6 + 7) --> 13                                           (5 + 13) --> 18                               (~)((18))
------------------------------------------ (EvalPlusR)   --------------------------------------------------------------------------- (BigStepBase)
(5 + (6 + 7)) --> (5 + 13)                               (5 + 13) ~~> 18
-------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
(5 + (6 + 7)) ~~> 18



> ((( \ x : Int . (x + 1) )) 5)
(Proof weight: 8, proof depth: 4)

                                                         (5 : "number")   (1 : "number")              (6 : "number")
                                                         ------------------------------- (EvalPlus)   -------------- (CanonNumber)
                                                         (5 + 1) --> 6                                (~)((6))
----------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------- (BigStepBase)
((( \ x : Int . (x + 1) )) 5) --> (5 + 1)                (5 + 1) ~~> 6
------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
((( \ x : Int . (x + 1) )) 5) ~~> 6



> ((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) )))
(Proof weight: 10, proof depth: 5)

                                                                                                                                                                       (5 : "number")   (1 : "number")              (6 : "number")
                                                                                                                                                                       ------------------------------- (EvalPlus)   -------------- (CanonNumber)
                                                                                                                                                                       (5 + 1) --> 6                                (~)((6))
                                                                                                              ----------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------- (BigStepBase)
                                                                                                              ((( \ i : Int . (i + 1) )) 5) --> (5 + 1)                (5 + 1) ~~> 6
---------------------------------------------------------------------------------------------- (EvalLamApp)   ------------------------------------------------------------------------------------------------------------------------------------------------ (BigStepRec)
((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) ))) --> ((( \ i : Int . (i + 1) )) 5)                ((( \ i : Int . (i + 1) )) 5) ~~> 6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
((( \ f : (Int -> Int) . (f 5) )) (( \ i : Int . (i + 1) ))) ~~> 6



> (If (If True Then False Else True) Then 123456 Else 42)
(Proof weight: 7, proof depth: 4)

                                                                                                                                                                (42 : "number")
---------------------------------------- (EvalIfTrue)                                                     ------------------------------------- (EvalIfFalse)   --------------- (CanonNumber)
(If True Then False Else True) --> False                                                                  (If False Then 123456 Else 42) --> 42                 (~)((42))
------------------------------------------------------------------------------------------ (EvalIfCond)   ----------------------------------------------------------------------------------- (BigStepBase)
(If (If True Then False Else True) Then 123456 Else 42) --> (If False Then 123456 Else 42)                (If False Then 123456 Else 42) ~~> 42
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- (BigStepRec)
(If (If True Then False Else True) Then 123456 Else 42) ~~> 42



